/****************************************Copyright (c)******************************************
**
**          懿航工作室   Copyright(C) 2011, Yehhon ,All rights reserved.
**
**-------------------------------------文件信息--------------------------------------------
  **  文 件 名: 
  **  描    述: 
  **  创 建 人:
  **  范围性质:    全局性头文件    
**--------------------------------------------------------------------------------------------
  **  修改历史:
  **  2011/09/19   Devil   建立
************************************************************************************************/

#ifndef  __YH_CLIB_H__ 
#define  __YH_CLIB_H__ 

/* 本地预定义 */
#ifdef YH_CLIB_LOCAL 
  	#define  EXT_YH_CLIB    
#else  
	#define  EXT_YH_CLIB    extern
#endif   


EXT_YH_CLIB void YHMemoryCopy(INT8U *source, INT8U *dest, INT32U copylong);
EXT_YH_CLIB INT8U YHMemoryCmp(INT8U *source, INT8U *dest, INT32U cmplong);
EXT_YH_CLIB INT8U YHMemoryClear(INT8U *dest, INT32U cmplong);

#endif  /* __YH_CLIB_H__ */

/*************************************************************************************************
**					　　　　　        END FILE
**************************************************************************************************/
