/****************************************Copyright (c)******************************************
**
**                懿航工作室   Copyright(C) 2011, Yehhon ,All rights reserved.
**
**-------------------------------------文件信息--------------------------------------------
  **  文 件 名:    YH_Queue.C 
  **  描    述:    懿航队列操作
  **  创 建 人:    Devil
**--------------------------------------------------------------------------------------------
  **  修改历史:
  **  2011/09/28   Devil   建立 
************************************************************************************************/
#include "../YH_CLib/YH_Type.h"
#define  YH_QUEUE_LOCAL 
#include "YH_Queue.h"

/*************************************************************************************************
** 函数名称:    YH_Queue8_Creat
** 功能描述: 	队列创建函数
** 输　  入:    Q8 队列名称 ，Buf 队列缓存空间，Maxlong 队列最大长度
** 输　  出:    无     
** 返 回 值:    TRUE 创建成功，FALSE 创建失败
** 先决条件: 	
** 全局变量: 
** 调用模块: 
**--------------------------------------------------------------------------------------------
** 修改记录:
** 2011/09/28   Devil   建立  
*************************************************************************************************/
INT32U YH_Queue8_Creat(YH_Queue8_TYPE *Q8,INT8U *Buf,INT32U MaxLong)
{
	if (Buf != NULL)
	{
		Q8->INIndex = 0;
		Q8->OUTIndex = 0;
		Q8->QBuf = Buf;	
		Q8->QMAXLong = MaxLong;	  
	
		return TRUE;
	}
	else
	{
		return FALSE;
	}
}
/*************************************************************************************************
** 函数名称:    YH_Queue8_In
** 功能描述: 	数据入队列
** 输　  入:    Q8，队列名称 ，写入数据首地址，CLong 待写入长度
** 输　  出:    无     
** 返 回 值:    返回成功写入的数据长度
** 先决条件: 	
** 全局变量: 
** 调用模块: 
**--------------------------------------------------------------------------------------------
** 修改记录:
** 2011/09/28   Devil   建立  
*************************************************************************************************/
INT32U YH_Queue8_In(YH_Queue8_TYPE *Q8,INT8U *Buf,INT32U CLong)
{
	uint32 i;
	uint32 tmp32;

	for(i=0;i<CLong;i++)
	{
		tmp32 = Q8->INIndex+1; 
		if(tmp32 >= Q8->QMAXLong) 
		{
			tmp32 = 0;
		}

		if(tmp32 == Q8->OUTIndex)
		{
			break;
		}
		else
		{
			Q8->QBuf[tmp32] = Buf[i];
			Q8->INIndex = tmp32;
		}  
	}

	return i;
}
/*************************************************************************************************
** 函数名称:    YH_Queue8_Out
** 功能描述: 	数据入队列
** 输　  入:    Q8，队列名称 ，Buf 读出数据首地址，CLong 待写入长度
** 输　  出:    无     
** 返 回 值:    返回成功读出的数据长度
** 先决条件: 	
** 全局变量: 
** 调用模块: 
**--------------------------------------------------------------------------------------------
** 修改记录:
** 2011/09/28   Devil   建立  
*************************************************************************************************/
INT32U YH_Queue8_Out(YH_Queue8_TYPE *Q8,INT8U *Buf,INT32U CLong)
{
	uint32 i;
	uint32 tmp32;

	for(i=0;i<CLong;i++)
	{
		tmp32 = Q8->OUTIndex;
		if(tmp32 == Q8->INIndex) 
		{
			break;
		}
		else
		{
			tmp32++; 
			if(tmp32 >= Q8->QMAXLong)
			{
				tmp32 = 0;
			}

			Buf[i] = Q8->QBuf[tmp32];
			Q8->OUTIndex = tmp32;
		}  
	}

	return i;
}

/*************************************************************************************************
**					　　　　　        END FILE
**************************************************************************************************/
